tap "jesseduffield/horcrux"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "supabase/tap"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Statistics utility to count lines of code
brew "cloc"
# Enhanced CLI Tools for Productivity
# Modern ls replacement with Git integration
brew "eza"
# Syntax-highlighted cat
brew "bat"
# Fast find alternative
brew "fd"
# Beautiful Git diffs
brew "delta"
# Modern du
brew "dust"
# Command benchmarking
brew "hyperfine"
# Simplified man pages
brew "tldr"
# Modern ps
brew "procs"
# Network bandwidth monitor
brew "bandwhich"
# Interactive tree view
brew "broot"
# Terminal dashboard
brew "wtfutil"
# Database tools
# Better PostgreSQL CLI
brew "pgcli"
# Better MySQL CLI
brew "mycli"
# Redis CLI
brew "redis"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A program for splitting your files into encrypted fragments
brew "jesseduffield/horcrux/horcrux"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Supabase CLI
brew "supabase/tap/supabase"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Control your tools with a few keystrokes
cask "raycast"
# OpenJDK distribution from Azul
cask "zulu@17"
